zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_RGM.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_MC_RGM.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_MC_RGM
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_MC_RGM_H_)  /* Check if memory map has not been already included */
#define S32K566_MC_RGM_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- MC_RGM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MC_RGM_Peripheral_Access_Layer MC_RGM Peripheral Access Layer
 * @{
 */

/** MC_RGM - Size of Registers Arrays */
#define MC_RGM_BOOT_CFG_COUNT                     2u

/** MC_RGM - Register Layout Typedef */
typedef struct MC_RGM_Struct {
  __IO uint32_t DES;                               /**< Destructive Event Status Register, offset: 0x0 */
  __IO uint32_t DERD;                              /**< Destructive Event Reset Disable Register, offset: 0x4 */
  __IO uint32_t FES;                               /**< Functional /External Reset Status Register, offset: 0x8 */
  __IO uint32_t FERD;                              /**< Functional Event Reset Disable Register, offset: 0xC */
  uint8_t RESERVED_0[4];
  __IO uint32_t FREC;                              /**< Functional Reset Escalation Counter Register, offset: 0x14 */
  __IO uint32_t FRET;                              /**< Functional Reset Escalation Threshold Register, offset: 0x18 */
  __IO uint32_t DRET;                              /**< Destructive Reset Escalation Threshold Register, offset: 0x1C */
  __IO uint32_t ERCTRL;                            /**< External Reset Control Register, offset: 0x20 */
  uint8_t RESERVED_1[16];
  __IO uint32_t REDL;                              /**< Reset Event During LPRUN, offset: 0x34 */
  uint8_t RESERVED_2[8];
  __IO uint32_t PRST0_0;                           /**< Peripheral Reset, offset: 0x40 */
  uint8_t RESERVED_3[4];
  __IO uint32_t PRST1_0;                           /**< Peripheral Reset, offset: 0x48 */
  uint8_t RESERVED_4[4];
  __IO uint32_t PRST2_0;                           /**< Peripheral Reset, offset: 0x50 */
  uint8_t RESERVED_5[4];
  __IO uint32_t PRST3_0;                           /**< Peripheral Reset, offset: 0x58 */
  uint8_t RESERVED_6[4];
  __IO uint32_t PRST4_0;                           /**< Peripheral Reset, offset: 0x60 */
  uint8_t RESERVED_7[4];
  __IO uint32_t PRST5_0;                           /**< Peripheral Reset, offset: 0x68 */
  uint8_t RESERVED_8[4];
  __IO uint32_t PRST6_0;                           /**< Peripheral Reset, offset: 0x70 */
  uint8_t RESERVED_9[4];
  __IO uint32_t PRST7_0;                           /**< Peripheral Reset, offset: 0x78 */
  uint8_t RESERVED_10[196];
  __I  uint32_t PSTAT0_0;                          /**< Peripheral Reset Status Register, offset: 0x140 */
  uint8_t RESERVED_11[4];
  __I  uint32_t PSTAT1_0;                          /**< Peripheral Reset Status Register, offset: 0x148 */
  uint8_t RESERVED_12[4];
  __I  uint32_t PSTAT2_0;                          /**< Peripheral Reset Status Register, offset: 0x150 */
  uint8_t RESERVED_13[4];
  __I  uint32_t PSTAT3_0;                          /**< Peripheral Reset Status Register, offset: 0x158 */
  uint8_t RESERVED_14[4];
  __I  uint32_t PSTAT4_0;                          /**< Peripheral Reset Status Register, offset: 0x160 */
  uint8_t RESERVED_15[4];
  __I  uint32_t PSTAT5_0;                          /**< Peripheral Reset Status Register, offset: 0x168 */
  uint8_t RESERVED_16[4];
  __I  uint32_t PSTAT6_0;                          /**< Peripheral Reset Status Register, offset: 0x170 */
  uint8_t RESERVED_17[4];
  __I  uint32_t PSTAT7_0;                          /**< Peripheral Reset Status Register, offset: 0x178 */
  uint8_t RESERVED_18[212];
  __IO uint32_t PRST_LPC;                          /**< Peripheral Reset LP Core, offset: 0x250 */
  __I  uint32_t PLPCSTAT;                          /**< Peripheral LP Core Status, offset: 0x254 */
  uint8_t RESERVED_19[8];
  __IO uint32_t CTL_KEY;                           /**< Control Key Register, offset: 0x260 */
  __IO uint32_t MODE_CONF;                         /**< Mode Configuration Register, offset: 0x264 */
  uint8_t RESERVED_20[8];
  __IO uint32_t EVT_STAT;                          /**< Event Status, offset: 0x270 */
  __IO uint32_t FPHTEC;                            /**< Functional Reset Entry Phase Timer Enable Control, offset: 0x274 */
  __IO uint32_t FPHTV;                             /**< Functional Reset Entry Phase Timer Value, offset: 0x278 */
  __IO uint32_t FPHTC;                             /**< Functional Reset Entry Phase Timer Control, offset: 0x27C */
  __IO uint32_t FPHTES;                            /**< Functional Reset Entry Phase Timer Expiry Status, offset: 0x280 */
  __I  uint32_t BOOT_VAL;                          /**< Boot Mode Value, offset: 0x284 */
  uint8_t RESERVED_21[8];
  __IO uint32_t BOOT_CFG[MC_RGM_BOOT_CFG_COUNT];   /**< Boot Configurations, array offset: 0x290, array step: 0x4 */
  uint8_t RESERVED_22[24];
  __IO uint32_t STDBYRTR;                          /**< Standby Request Timeout Register, offset: 0x2B0 */
  __I  uint32_t MODE_STAT;                         /**< Mode Status Register, offset: 0x2B4 */
  __IO uint32_t DRATO;                             /**< Destructive Request Acknowledge Timeout Register, offset: 0x2B8 */
} MC_RGM_Type, *MC_RGM_MemMapPtr;

