zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_RGM.h
/** Number of instances of the MC_RGM module. */
#define MC_RGM_INSTANCE_COUNT                    (1u)

/* MC_RGM - Peripheral instance base addresses */
/** Peripheral LPE_MC_RGM base address */
#define IP_LPE_MC_RGM_BASE                       (0x42074000u)
/** Peripheral LPE_MC_RGM base pointer */
#define IP_LPE_MC_RGM                            ((MC_RGM_Type *)IP_LPE_MC_RGM_BASE)
/** Array initializer of MC_RGM peripheral base addresses */
#define IP_MC_RGM_BASE_ADDRS                     { IP_LPE_MC_RGM_BASE }
/** Array initializer of MC_RGM peripheral base pointers */
#define IP_MC_RGM_BASE_PTRS                      { IP_LPE_MC_RGM }

/* ----------------------------------------------------------------------------
   -- MC_RGM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MC_RGM_Register_Masks MC_RGM Register Masks
 * @{
 */

/*! @name DES - Destructive Event Status Register */
/*! @{ */

#define MC_RGM_DES_F_DR_0_MASK                   (0x1U)
#define MC_RGM_DES_F_DR_0_SHIFT                  (0U)
#define MC_RGM_DES_F_DR_0_WIDTH                  (1U)
#define MC_RGM_DES_F_DR_0(x)                     (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_F_DR_0_SHIFT)) & MC_RGM_DES_F_DR_0_MASK)

#define MC_RGM_DES_F_DR_1_MASK                   (0x2U)
#define MC_RGM_DES_F_DR_1_SHIFT                  (1U)
#define MC_RGM_DES_F_DR_1_WIDTH                  (1U)
#define MC_RGM_DES_F_DR_1(x)                     (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_F_DR_1_SHIFT)) & MC_RGM_DES_F_DR_1_MASK)

#define MC_RGM_DES_F_DR_2_MASK                   (0x4U)
#define MC_RGM_DES_F_DR_2_SHIFT                  (2U)
#define MC_RGM_DES_F_DR_2_WIDTH                  (1U)
#define MC_RGM_DES_F_DR_2(x)                     (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_F_DR_2_SHIFT)) & MC_RGM_DES_F_DR_2_MASK)

#define MC_RGM_DES_F_DR_3_MASK                   (0x8U)
#define MC_RGM_DES_F_DR_3_SHIFT                  (3U)
#define MC_RGM_DES_F_DR_3_WIDTH                  (1U)
#define MC_RGM_DES_F_DR_3(x)                     (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_F_DR_3_SHIFT)) & MC_RGM_DES_F_DR_3_MASK)

#define MC_RGM_DES_RGM_FRE_MASK                  (0x400U)
#define MC_RGM_DES_RGM_FRE_SHIFT                 (10U)
#define MC_RGM_DES_RGM_FRE_WIDTH                 (1U)
#define MC_RGM_DES_RGM_FRE(x)                    (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_RGM_FRE_SHIFT)) & MC_RGM_DES_RGM_FRE_MASK)

#define MC_RGM_DES_PLL0_LOL_MASK                 (0x800U)
#define MC_RGM_DES_PLL0_LOL_SHIFT                (11U)
#define MC_RGM_DES_PLL0_LOL_WIDTH                (1U)
#define MC_RGM_DES_PLL0_LOL(x)                   (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_PLL0_LOL_SHIFT)) & MC_RGM_DES_PLL0_LOL_MASK)

#define MC_RGM_DES_SW_DEST_RST_MASK              (0x1000U)
#define MC_RGM_DES_SW_DEST_RST_SHIFT             (12U)
#define MC_RGM_DES_SW_DEST_RST_WIDTH             (1U)
#define MC_RGM_DES_SW_DEST_RST(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_SW_DEST_RST_SHIFT)) & MC_RGM_DES_SW_DEST_RST_MASK)

#define MC_RGM_DES_CPE_PLL_LOL_MASK              (0x2000U)
#define MC_RGM_DES_CPE_PLL_LOL_SHIFT             (13U)
#define MC_RGM_DES_CPE_PLL_LOL_WIDTH             (1U)
#define MC_RGM_DES_CPE_PLL_LOL(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_CPE_PLL_LOL_SHIFT)) & MC_RGM_DES_CPE_PLL_LOL_MASK)

#define MC_RGM_DES_CSTCU_URF_MASK                (0x4000U)
#define MC_RGM_DES_CSTCU_URF_SHIFT               (14U)
#define MC_RGM_DES_CSTCU_URF_WIDTH               (1U)
#define MC_RGM_DES_CSTCU_URF(x)                  (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_CSTCU_URF_SHIFT)) & MC_RGM_DES_CSTCU_URF_MASK)

#define MC_RGM_DES_DEBUG_DEST_RST_MASK           (0x8000U)
#define MC_RGM_DES_DEBUG_DEST_RST_SHIFT          (15U)
#define MC_RGM_DES_DEBUG_DEST_RST_WIDTH          (1U)
#define MC_RGM_DES_DEBUG_DEST_RST(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_DEBUG_DEST_RST_SHIFT)) & MC_RGM_DES_DEBUG_DEST_RST_MASK)

#define MC_RGM_DES_HSE2_TOP__S4v1_LMDA_32k_RESET_REQ_B_MASK (0x10000U)
#define MC_RGM_DES_HSE2_TOP__S4v1_LMDA_32k_RESET_REQ_B_SHIFT (16U)
#define MC_RGM_DES_HSE2_TOP__S4v1_LMDA_32k_RESET_REQ_B_WIDTH (1U)
#define MC_RGM_DES_HSE2_TOP__S4v1_LMDA_32k_RESET_REQ_B(x) (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_HSE2_TOP__S4v1_LMDA_32k_RESET_REQ_B_SHIFT)) & MC_RGM_DES_HSE2_TOP__S4v1_LMDA_32k_RESET_REQ_B_MASK)

#define MC_RGM_DES_HSE2_TOP__S4v1_LMDA_RESET_REQ_B_MASK (0x20000U)
#define MC_RGM_DES_HSE2_TOP__S4v1_LMDA_RESET_REQ_B_SHIFT (17U)
#define MC_RGM_DES_HSE2_TOP__S4v1_LMDA_RESET_REQ_B_WIDTH (1U)
#define MC_RGM_DES_HSE2_TOP__S4v1_LMDA_RESET_REQ_B(x) (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_HSE2_TOP__S4v1_LMDA_RESET_REQ_B_SHIFT)) & MC_RGM_DES_HSE2_TOP__S4v1_LMDA_RESET_REQ_B_MASK)

#define MC_RGM_DES_HSE2_TOP__S4v1_LMDA_SYS_FAIL_MASK (0x40000U)
#define MC_RGM_DES_HSE2_TOP__S4v1_LMDA_SYS_FAIL_SHIFT (18U)
#define MC_RGM_DES_HSE2_TOP__S4v1_LMDA_SYS_FAIL_WIDTH (1U)
#define MC_RGM_DES_HSE2_TOP__S4v1_LMDA_SYS_FAIL(x) (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_HSE2_TOP__S4v1_LMDA_SYS_FAIL_SHIFT)) & MC_RGM_DES_HSE2_TOP__S4v1_LMDA_SYS_FAIL_MASK)

#define MC_RGM_DES_HSE2_TOP__S4v1_EVENT_SYS_RESET_REQ_MASK (0x80000U)
#define MC_RGM_DES_HSE2_TOP__S4v1_EVENT_SYS_RESET_REQ_SHIFT (19U)
#define MC_RGM_DES_HSE2_TOP__S4v1_EVENT_SYS_RESET_REQ_WIDTH (1U)
#define MC_RGM_DES_HSE2_TOP__S4v1_EVENT_SYS_RESET_REQ(x) (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_HSE2_TOP__S4v1_EVENT_SYS_RESET_REQ_SHIFT)) & MC_RGM_DES_HSE2_TOP__S4v1_EVENT_SYS_RESET_REQ_MASK)

#define MC_RGM_DES_SYS_DIV_FAIL_MASK             (0x100000U)
#define MC_RGM_DES_SYS_DIV_FAIL_SHIFT            (20U)
#define MC_RGM_DES_SYS_DIV_FAIL_WIDTH            (1U)
#define MC_RGM_DES_SYS_DIV_FAIL(x)               (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_SYS_DIV_FAIL_SHIFT)) & MC_RGM_DES_SYS_DIV_FAIL_MASK)

#define MC_RGM_DES_VFCCU_DEST_RST_MASK           (0x200000U)
#define MC_RGM_DES_VFCCU_DEST_RST_SHIFT          (21U)
#define MC_RGM_DES_VFCCU_DEST_RST_WIDTH          (1U)
#define MC_RGM_DES_VFCCU_DEST_RST(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_VFCCU_DEST_RST_SHIFT)) & MC_RGM_DES_VFCCU_DEST_RST_MASK)

#define MC_RGM_DES_CSTCU_DEST_MASK               (0x1000000U)
#define MC_RGM_DES_CSTCU_DEST_SHIFT              (24U)
#define MC_RGM_DES_CSTCU_DEST_WIDTH              (1U)
#define MC_RGM_DES_CSTCU_DEST(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_CSTCU_DEST_SHIFT)) & MC_RGM_DES_CSTCU_DEST_MASK)

#define MC_RGM_DES_FUNC_RST_ENTRY_TIMEOUT_MASK   (0x2000000U)
#define MC_RGM_DES_FUNC_RST_ENTRY_TIMEOUT_SHIFT  (25U)
#define MC_RGM_DES_FUNC_RST_ENTRY_TIMEOUT_WIDTH  (1U)
#define MC_RGM_DES_FUNC_RST_ENTRY_TIMEOUT(x)     (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_FUNC_RST_ENTRY_TIMEOUT_SHIFT)) & MC_RGM_DES_FUNC_RST_ENTRY_TIMEOUT_MASK)
/*! @} */

/*! @name DERD - Destructive Event Reset Disable Register */
/*! @{ */

