zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_RGM.h
#define MC_RGM_DERD_D_F_DR_0_MASK                (0x1U)
#define MC_RGM_DERD_D_F_DR_0_SHIFT               (0U)
#define MC_RGM_DERD_D_F_DR_0_WIDTH               (1U)
#define MC_RGM_DERD_D_F_DR_0(x)                  (((uint32_t)(((uint32_t)(x)) << MC_RGM_DERD_D_F_DR_0_SHIFT)) & MC_RGM_DERD_D_F_DR_0_MASK)

#define MC_RGM_DERD_D_F_DR_1_MASK                (0x2U)
#define MC_RGM_DERD_D_F_DR_1_SHIFT               (1U)
#define MC_RGM_DERD_D_F_DR_1_WIDTH               (1U)
#define MC_RGM_DERD_D_F_DR_1(x)                  (((uint32_t)(((uint32_t)(x)) << MC_RGM_DERD_D_F_DR_1_SHIFT)) & MC_RGM_DERD_D_F_DR_1_MASK)

#define MC_RGM_DERD_D_F_DR_2_MASK                (0x4U)
#define MC_RGM_DERD_D_F_DR_2_SHIFT               (2U)
#define MC_RGM_DERD_D_F_DR_2_WIDTH               (1U)
#define MC_RGM_DERD_D_F_DR_2(x)                  (((uint32_t)(((uint32_t)(x)) << MC_RGM_DERD_D_F_DR_2_SHIFT)) & MC_RGM_DERD_D_F_DR_2_MASK)

#define MC_RGM_DERD_D_F_DR_3_MASK                (0x8U)
#define MC_RGM_DERD_D_F_DR_3_SHIFT               (3U)
#define MC_RGM_DERD_D_F_DR_3_WIDTH               (1U)
#define MC_RGM_DERD_D_F_DR_3(x)                  (((uint32_t)(((uint32_t)(x)) << MC_RGM_DERD_D_F_DR_3_SHIFT)) & MC_RGM_DERD_D_F_DR_3_MASK)

#define MC_RGM_DERD_D_PLL0_LOL_MASK              (0x800U)
#define MC_RGM_DERD_D_PLL0_LOL_SHIFT             (11U)
#define MC_RGM_DERD_D_PLL0_LOL_WIDTH             (1U)
#define MC_RGM_DERD_D_PLL0_LOL(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_DERD_D_PLL0_LOL_SHIFT)) & MC_RGM_DERD_D_PLL0_LOL_MASK)

#define MC_RGM_DERD_D_CPE_PLL_LOL_MASK           (0x2000U)
#define MC_RGM_DERD_D_CPE_PLL_LOL_SHIFT          (13U)
#define MC_RGM_DERD_D_CPE_PLL_LOL_WIDTH          (1U)
#define MC_RGM_DERD_D_CPE_PLL_LOL(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_DERD_D_CPE_PLL_LOL_SHIFT)) & MC_RGM_DERD_D_CPE_PLL_LOL_MASK)

#define MC_RGM_DERD_D_DEBUG_DEST_RST_MASK        (0x8000U)
#define MC_RGM_DERD_D_DEBUG_DEST_RST_SHIFT       (15U)
#define MC_RGM_DERD_D_DEBUG_DEST_RST_WIDTH       (1U)
#define MC_RGM_DERD_D_DEBUG_DEST_RST(x)          (((uint32_t)(((uint32_t)(x)) << MC_RGM_DERD_D_DEBUG_DEST_RST_SHIFT)) & MC_RGM_DERD_D_DEBUG_DEST_RST_MASK)
/*! @} */

/*! @name FES - Functional /External Reset Status Register */
/*! @{ */

#define MC_RGM_FES_F_EXR_MASK                    (0x1U)
#define MC_RGM_FES_F_EXR_SHIFT                   (0U)
#define MC_RGM_FES_F_EXR_WIDTH                   (1U)
#define MC_RGM_FES_F_EXR(x)                      (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_F_EXR_SHIFT)) & MC_RGM_FES_F_EXR_MASK)

#define MC_RGM_FES_PLL1_LOL_MASK                 (0x2U)
#define MC_RGM_FES_PLL1_LOL_SHIFT                (1U)
#define MC_RGM_FES_PLL1_LOL_WIDTH                (1U)
#define MC_RGM_FES_PLL1_LOL(x)                   (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_PLL1_LOL_SHIFT)) & MC_RGM_FES_PLL1_LOL_MASK)

#define MC_RGM_FES_DEBUG_SUB_JTAGC_JTAG_RST_B_MASK (0x4U)
#define MC_RGM_FES_DEBUG_SUB_JTAGC_JTAG_RST_B_SHIFT (2U)
#define MC_RGM_FES_DEBUG_SUB_JTAGC_JTAG_RST_B_WIDTH (1U)
#define MC_RGM_FES_DEBUG_SUB_JTAGC_JTAG_RST_B(x) (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_DEBUG_SUB_JTAGC_JTAG_RST_B_SHIFT)) & MC_RGM_FES_DEBUG_SUB_JTAGC_JTAG_RST_B_MASK)

#define MC_RGM_FES_LPE_MC_ME_o_FUNC_RESETSEQ_REQ_MASK (0x8U)
#define MC_RGM_FES_LPE_MC_ME_o_FUNC_RESETSEQ_REQ_SHIFT (3U)
#define MC_RGM_FES_LPE_MC_ME_o_FUNC_RESETSEQ_REQ_WIDTH (1U)
#define MC_RGM_FES_LPE_MC_ME_o_FUNC_RESETSEQ_REQ(x) (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_LPE_MC_ME_o_FUNC_RESETSEQ_REQ_SHIFT)) & MC_RGM_FES_LPE_MC_ME_o_FUNC_RESETSEQ_REQ_MASK)

#define MC_RGM_FES_SWT_STARTUP_MASK              (0x100U)
#define MC_RGM_FES_SWT_STARTUP_SHIFT             (8U)
#define MC_RGM_FES_SWT_STARTUP_WIDTH             (1U)
#define MC_RGM_FES_SWT_STARTUP(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_SWT_STARTUP_SHIFT)) & MC_RGM_FES_SWT_STARTUP_MASK)

#define MC_RGM_FES_LPE_SWT_MASK                  (0x200U)
#define MC_RGM_FES_LPE_SWT_SHIFT                 (9U)
#define MC_RGM_FES_LPE_SWT_WIDTH                 (1U)
#define MC_RGM_FES_LPE_SWT(x)                    (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_LPE_SWT_SHIFT)) & MC_RGM_FES_LPE_SWT_MASK)

#define MC_RGM_FES_DEBUG_FUNC_RST_MASK           (0x400U)
#define MC_RGM_FES_DEBUG_FUNC_RST_SHIFT          (10U)
#define MC_RGM_FES_DEBUG_FUNC_RST_WIDTH          (1U)
#define MC_RGM_FES_DEBUG_FUNC_RST(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_DEBUG_FUNC_RST_SHIFT)) & MC_RGM_FES_DEBUG_FUNC_RST_MASK)

#define MC_RGM_FES_ST_DONE_MASK                  (0x800U)
#define MC_RGM_FES_ST_DONE_SHIFT                 (11U)
#define MC_RGM_FES_ST_DONE_WIDTH                 (1U)
#define MC_RGM_FES_ST_DONE(x)                    (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_ST_DONE_SHIFT)) & MC_RGM_FES_ST_DONE_MASK)

#define MC_RGM_FES_FCCU_FUNC_RST_MASK            (0x1000U)
#define MC_RGM_FES_FCCU_FUNC_RST_SHIFT           (12U)
#define MC_RGM_FES_FCCU_FUNC_RST_WIDTH           (1U)
#define MC_RGM_FES_FCCU_FUNC_RST(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_FCCU_FUNC_RST_SHIFT)) & MC_RGM_FES_FCCU_FUNC_RST_MASK)

#define MC_RGM_FES_HSE2_TOP__S4v1_LMDA_LIFECYCLE_BRICKED_MASK (0x10000U)
#define MC_RGM_FES_HSE2_TOP__S4v1_LMDA_LIFECYCLE_BRICKED_SHIFT (16U)
#define MC_RGM_FES_HSE2_TOP__S4v1_LMDA_LIFECYCLE_BRICKED_WIDTH (1U)
#define MC_RGM_FES_HSE2_TOP__S4v1_LMDA_LIFECYCLE_BRICKED(x) (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_HSE2_TOP__S4v1_LMDA_LIFECYCLE_BRICKED_SHIFT)) & MC_RGM_FES_HSE2_TOP__S4v1_LMDA_LIFECYCLE_BRICKED_MASK)

#define MC_RGM_FES_HSE2_TOP__s4v1_WDOG_RESET_REQ_N_MASK (0x20000U)
#define MC_RGM_FES_HSE2_TOP__s4v1_WDOG_RESET_REQ_N_SHIFT (17U)
#define MC_RGM_FES_HSE2_TOP__s4v1_WDOG_RESET_REQ_N_WIDTH (1U)
#define MC_RGM_FES_HSE2_TOP__s4v1_WDOG_RESET_REQ_N(x) (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_HSE2_TOP__s4v1_WDOG_RESET_REQ_N_SHIFT)) & MC_RGM_FES_HSE2_TOP__s4v1_WDOG_RESET_REQ_N_MASK)
/*! @} */

/*! @name FERD - Functional Event Reset Disable Register */
/*! @{ */

#define MC_RGM_FERD_D_PLL1_LOL_MASK              (0x2U)
#define MC_RGM_FERD_D_PLL1_LOL_SHIFT             (1U)
#define MC_RGM_FERD_D_PLL1_LOL_WIDTH             (1U)
#define MC_RGM_FERD_D_PLL1_LOL(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FERD_D_PLL1_LOL_SHIFT)) & MC_RGM_FERD_D_PLL1_LOL_MASK)

#define MC_RGM_FERD_D_DEBUG_FUNC_RST_MASK        (0x400U)
#define MC_RGM_FERD_D_DEBUG_FUNC_RST_SHIFT       (10U)
#define MC_RGM_FERD_D_DEBUG_FUNC_RST_WIDTH       (1U)
#define MC_RGM_FERD_D_DEBUG_FUNC_RST(x)          (((uint32_t)(((uint32_t)(x)) << MC_RGM_FERD_D_DEBUG_FUNC_RST_SHIFT)) & MC_RGM_FERD_D_DEBUG_FUNC_RST_MASK)
/*! @} */

