zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_RGM.h
/*! @name FREC - Functional Reset Escalation Counter Register */
/*! @{ */

#define MC_RGM_FREC_FREC_MASK                    (0xFU)
#define MC_RGM_FREC_FREC_SHIFT                   (0U)
#define MC_RGM_FREC_FREC_WIDTH                   (4U)
#define MC_RGM_FREC_FREC(x)                      (((uint32_t)(((uint32_t)(x)) << MC_RGM_FREC_FREC_SHIFT)) & MC_RGM_FREC_FREC_MASK)
/*! @} */

/*! @name FRET - Functional Reset Escalation Threshold Register */
/*! @{ */

#define MC_RGM_FRET_FRET_MASK                    (0xFU)
#define MC_RGM_FRET_FRET_SHIFT                   (0U)
#define MC_RGM_FRET_FRET_WIDTH                   (4U)
#define MC_RGM_FRET_FRET(x)                      (((uint32_t)(((uint32_t)(x)) << MC_RGM_FRET_FRET_SHIFT)) & MC_RGM_FRET_FRET_MASK)
/*! @} */

/*! @name DRET - Destructive Reset Escalation Threshold Register */
/*! @{ */

#define MC_RGM_DRET_DRET_MASK                    (0xFU)
#define MC_RGM_DRET_DRET_SHIFT                   (0U)
#define MC_RGM_DRET_DRET_WIDTH                   (4U)
#define MC_RGM_DRET_DRET(x)                      (((uint32_t)(((uint32_t)(x)) << MC_RGM_DRET_DRET_SHIFT)) & MC_RGM_DRET_DRET_MASK)
/*! @} */

/*! @name ERCTRL - External Reset Control Register */
/*! @{ */

#define MC_RGM_ERCTRL_ERASSERT_MASK              (0x1U)
#define MC_RGM_ERCTRL_ERASSERT_SHIFT             (0U)
#define MC_RGM_ERCTRL_ERASSERT_WIDTH             (1U)
#define MC_RGM_ERCTRL_ERASSERT(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_ERCTRL_ERASSERT_SHIFT)) & MC_RGM_ERCTRL_ERASSERT_MASK)
/*! @} */

/*! @name REDL - Reset Event During LPRUN */
/*! @{ */

#define MC_RGM_REDL_DES_RES_MASK                 (0x1U)
#define MC_RGM_REDL_DES_RES_SHIFT                (0U)
#define MC_RGM_REDL_DES_RES_WIDTH                (1U)
#define MC_RGM_REDL_DES_RES(x)                   (((uint32_t)(((uint32_t)(x)) << MC_RGM_REDL_DES_RES_SHIFT)) & MC_RGM_REDL_DES_RES_MASK)

#define MC_RGM_REDL_FES_RES_MASK                 (0x2U)
#define MC_RGM_REDL_FES_RES_SHIFT                (1U)
#define MC_RGM_REDL_FES_RES_WIDTH                (1U)
#define MC_RGM_REDL_FES_RES(x)                   (((uint32_t)(((uint32_t)(x)) << MC_RGM_REDL_FES_RES_SHIFT)) & MC_RGM_REDL_FES_RES_MASK)
/*! @} */

/*! @name PRST0_0 - Peripheral Reset */
/*! @{ */

#define MC_RGM_PRST0_0_PERIPH_0_RST_MASK         (0x1U)
#define MC_RGM_PRST0_0_PERIPH_0_RST_SHIFT        (0U)
#define MC_RGM_PRST0_0_PERIPH_0_RST_WIDTH        (1U)
#define MC_RGM_PRST0_0_PERIPH_0_RST(x)           (((uint32_t)(((uint32_t)(x)) << MC_RGM_PRST0_0_PERIPH_0_RST_SHIFT)) & MC_RGM_PRST0_0_PERIPH_0_RST_MASK)
/*! @} */

/*! @name PRST1_0 - Peripheral Reset */
/*! @{ */

#define MC_RGM_PRST1_0_PERIPH_64_RST_MASK        (0x1U)
#define MC_RGM_PRST1_0_PERIPH_64_RST_SHIFT       (0U)
#define MC_RGM_PRST1_0_PERIPH_64_RST_WIDTH       (1U)
#define MC_RGM_PRST1_0_PERIPH_64_RST(x)          (((uint32_t)(((uint32_t)(x)) << MC_RGM_PRST1_0_PERIPH_64_RST_SHIFT)) & MC_RGM_PRST1_0_PERIPH_64_RST_MASK)
/*! @} */

/*! @name PRST2_0 - Peripheral Reset */
/*! @{ */

#define MC_RGM_PRST2_0_PERIPH_128_RST_MASK       (0x1U)
#define MC_RGM_PRST2_0_PERIPH_128_RST_SHIFT      (0U)
#define MC_RGM_PRST2_0_PERIPH_128_RST_WIDTH      (1U)
#define MC_RGM_PRST2_0_PERIPH_128_RST(x)         (((uint32_t)(((uint32_t)(x)) << MC_RGM_PRST2_0_PERIPH_128_RST_SHIFT)) & MC_RGM_PRST2_0_PERIPH_128_RST_MASK)
/*! @} */

/*! @name PRST3_0 - Peripheral Reset */
/*! @{ */

#define MC_RGM_PRST3_0_PERIPH_192_RST_MASK       (0x1U)
#define MC_RGM_PRST3_0_PERIPH_192_RST_SHIFT      (0U)
#define MC_RGM_PRST3_0_PERIPH_192_RST_WIDTH      (1U)
#define MC_RGM_PRST3_0_PERIPH_192_RST(x)         (((uint32_t)(((uint32_t)(x)) << MC_RGM_PRST3_0_PERIPH_192_RST_SHIFT)) & MC_RGM_PRST3_0_PERIPH_192_RST_MASK)
/*! @} */

/*! @name PRST4_0 - Peripheral Reset */
/*! @{ */

#define MC_RGM_PRST4_0_PERIPH_256_RST_MASK       (0x1U)
#define MC_RGM_PRST4_0_PERIPH_256_RST_SHIFT      (0U)
#define MC_RGM_PRST4_0_PERIPH_256_RST_WIDTH      (1U)
#define MC_RGM_PRST4_0_PERIPH_256_RST(x)         (((uint32_t)(((uint32_t)(x)) << MC_RGM_PRST4_0_PERIPH_256_RST_SHIFT)) & MC_RGM_PRST4_0_PERIPH_256_RST_MASK)
/*! @} */

/*! @name PRST5_0 - Peripheral Reset */
/*! @{ */

#define MC_RGM_PRST5_0_PERIPH_320_RST_MASK       (0x1U)
#define MC_RGM_PRST5_0_PERIPH_320_RST_SHIFT      (0U)
#define MC_RGM_PRST5_0_PERIPH_320_RST_WIDTH      (1U)
#define MC_RGM_PRST5_0_PERIPH_320_RST(x)         (((uint32_t)(((uint32_t)(x)) << MC_RGM_PRST5_0_PERIPH_320_RST_SHIFT)) & MC_RGM_PRST5_0_PERIPH_320_RST_MASK)
/*! @} */

/*! @name PRST6_0 - Peripheral Reset */
/*! @{ */

#define MC_RGM_PRST6_0_PERIPH_384_RST_MASK       (0x1U)
#define MC_RGM_PRST6_0_PERIPH_384_RST_SHIFT      (0U)
#define MC_RGM_PRST6_0_PERIPH_384_RST_WIDTH      (1U)
#define MC_RGM_PRST6_0_PERIPH_384_RST(x)         (((uint32_t)(((uint32_t)(x)) << MC_RGM_PRST6_0_PERIPH_384_RST_SHIFT)) & MC_RGM_PRST6_0_PERIPH_384_RST_MASK)
/*! @} */

/*! @name PRST7_0 - Peripheral Reset */
/*! @{ */

#define MC_RGM_PRST7_0_PERIPH_448_RST_MASK       (0x1U)
#define MC_RGM_PRST7_0_PERIPH_448_RST_SHIFT      (0U)
#define MC_RGM_PRST7_0_PERIPH_448_RST_WIDTH      (1U)
#define MC_RGM_PRST7_0_PERIPH_448_RST(x)         (((uint32_t)(((uint32_t)(x)) << MC_RGM_PRST7_0_PERIPH_448_RST_SHIFT)) & MC_RGM_PRST7_0_PERIPH_448_RST_MASK)
/*! @} */

/*! @name PSTAT0_0 - Peripheral Reset Status Register */
/*! @{ */

#define MC_RGM_PSTAT0_0_PERIPH_0_STAT_MASK       (0x1U)
#define MC_RGM_PSTAT0_0_PERIPH_0_STAT_SHIFT      (0U)
#define MC_RGM_PSTAT0_0_PERIPH_0_STAT_WIDTH      (1U)
#define MC_RGM_PSTAT0_0_PERIPH_0_STAT(x)         (((uint32_t)(((uint32_t)(x)) << MC_RGM_PSTAT0_0_PERIPH_0_STAT_SHIFT)) & MC_RGM_PSTAT0_0_PERIPH_0_STAT_MASK)
/*! @} */

/*! @name PSTAT1_0 - Peripheral Reset Status Register */
/*! @{ */

#define MC_RGM_PSTAT1_0_PERIPH_64_STAT_MASK      (0x1U)
#define MC_RGM_PSTAT1_0_PERIPH_64_STAT_SHIFT     (0U)
#define MC_RGM_PSTAT1_0_PERIPH_64_STAT_WIDTH     (1U)
#define MC_RGM_PSTAT1_0_PERIPH_64_STAT(x)        (((uint32_t)(((uint32_t)(x)) << MC_RGM_PSTAT1_0_PERIPH_64_STAT_SHIFT)) & MC_RGM_PSTAT1_0_PERIPH_64_STAT_MASK)
/*! @} */

/*! @name PSTAT2_0 - Peripheral Reset Status Register */
/*! @{ */

