zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_RGM.h
#define MC_RGM_PSTAT2_0_PERIPH_128_STAT_MASK     (0x1U)
#define MC_RGM_PSTAT2_0_PERIPH_128_STAT_SHIFT    (0U)
#define MC_RGM_PSTAT2_0_PERIPH_128_STAT_WIDTH    (1U)
#define MC_RGM_PSTAT2_0_PERIPH_128_STAT(x)       (((uint32_t)(((uint32_t)(x)) << MC_RGM_PSTAT2_0_PERIPH_128_STAT_SHIFT)) & MC_RGM_PSTAT2_0_PERIPH_128_STAT_MASK)
/*! @} */

/*! @name PSTAT3_0 - Peripheral Reset Status Register */
/*! @{ */

#define MC_RGM_PSTAT3_0_PERIPH_192_STAT_MASK     (0x1U)
#define MC_RGM_PSTAT3_0_PERIPH_192_STAT_SHIFT    (0U)
#define MC_RGM_PSTAT3_0_PERIPH_192_STAT_WIDTH    (1U)
#define MC_RGM_PSTAT3_0_PERIPH_192_STAT(x)       (((uint32_t)(((uint32_t)(x)) << MC_RGM_PSTAT3_0_PERIPH_192_STAT_SHIFT)) & MC_RGM_PSTAT3_0_PERIPH_192_STAT_MASK)
/*! @} */

/*! @name PSTAT4_0 - Peripheral Reset Status Register */
/*! @{ */

#define MC_RGM_PSTAT4_0_PERIPH_256_STAT_MASK     (0x1U)
#define MC_RGM_PSTAT4_0_PERIPH_256_STAT_SHIFT    (0U)
#define MC_RGM_PSTAT4_0_PERIPH_256_STAT_WIDTH    (1U)
#define MC_RGM_PSTAT4_0_PERIPH_256_STAT(x)       (((uint32_t)(((uint32_t)(x)) << MC_RGM_PSTAT4_0_PERIPH_256_STAT_SHIFT)) & MC_RGM_PSTAT4_0_PERIPH_256_STAT_MASK)
/*! @} */

/*! @name PSTAT5_0 - Peripheral Reset Status Register */
/*! @{ */

#define MC_RGM_PSTAT5_0_PERIPH_320_STAT_MASK     (0x1U)
#define MC_RGM_PSTAT5_0_PERIPH_320_STAT_SHIFT    (0U)
#define MC_RGM_PSTAT5_0_PERIPH_320_STAT_WIDTH    (1U)
#define MC_RGM_PSTAT5_0_PERIPH_320_STAT(x)       (((uint32_t)(((uint32_t)(x)) << MC_RGM_PSTAT5_0_PERIPH_320_STAT_SHIFT)) & MC_RGM_PSTAT5_0_PERIPH_320_STAT_MASK)
/*! @} */

/*! @name PSTAT6_0 - Peripheral Reset Status Register */
/*! @{ */

#define MC_RGM_PSTAT6_0_PERIPH_384_STAT_MASK     (0x1U)
#define MC_RGM_PSTAT6_0_PERIPH_384_STAT_SHIFT    (0U)
#define MC_RGM_PSTAT6_0_PERIPH_384_STAT_WIDTH    (1U)
#define MC_RGM_PSTAT6_0_PERIPH_384_STAT(x)       (((uint32_t)(((uint32_t)(x)) << MC_RGM_PSTAT6_0_PERIPH_384_STAT_SHIFT)) & MC_RGM_PSTAT6_0_PERIPH_384_STAT_MASK)
/*! @} */

/*! @name PSTAT7_0 - Peripheral Reset Status Register */
/*! @{ */

#define MC_RGM_PSTAT7_0_PERIPH_448_STAT_MASK     (0x1U)
#define MC_RGM_PSTAT7_0_PERIPH_448_STAT_SHIFT    (0U)
#define MC_RGM_PSTAT7_0_PERIPH_448_STAT_WIDTH    (1U)
#define MC_RGM_PSTAT7_0_PERIPH_448_STAT(x)       (((uint32_t)(((uint32_t)(x)) << MC_RGM_PSTAT7_0_PERIPH_448_STAT_SHIFT)) & MC_RGM_PSTAT7_0_PERIPH_448_STAT_MASK)
/*! @} */

/*! @name PRST_LPC - Peripheral Reset LP Core */
/*! @{ */

#define MC_RGM_PRST_LPC_LPC0_RST_MASK            (0x1U)
#define MC_RGM_PRST_LPC_LPC0_RST_SHIFT           (0U)
#define MC_RGM_PRST_LPC_LPC0_RST_WIDTH           (1U)
#define MC_RGM_PRST_LPC_LPC0_RST(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_PRST_LPC_LPC0_RST_SHIFT)) & MC_RGM_PRST_LPC_LPC0_RST_MASK)
/*! @} */

/*! @name PLPCSTAT - Peripheral LP Core Status */
/*! @{ */

#define MC_RGM_PLPCSTAT_LPC0_RSTS_MASK           (0x1U)
#define MC_RGM_PLPCSTAT_LPC0_RSTS_SHIFT          (0U)
#define MC_RGM_PLPCSTAT_LPC0_RSTS_WIDTH          (1U)
#define MC_RGM_PLPCSTAT_LPC0_RSTS(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_PLPCSTAT_LPC0_RSTS_SHIFT)) & MC_RGM_PLPCSTAT_LPC0_RSTS_MASK)
/*! @} */

/*! @name CTL_KEY - Control Key Register */
/*! @{ */

#define MC_RGM_CTL_KEY_KEY_MASK                  (0xFFFFU)
#define MC_RGM_CTL_KEY_KEY_SHIFT                 (0U)
#define MC_RGM_CTL_KEY_KEY_WIDTH                 (16U)
#define MC_RGM_CTL_KEY_KEY(x)                    (((uint32_t)(((uint32_t)(x)) << MC_RGM_CTL_KEY_KEY_SHIFT)) & MC_RGM_CTL_KEY_KEY_MASK)
/*! @} */

/*! @name MODE_CONF - Mode Configuration Register */
/*! @{ */

#define MC_RGM_MODE_CONF_POR_RST_MASK            (0x1U)
#define MC_RGM_MODE_CONF_POR_RST_SHIFT           (0U)
#define MC_RGM_MODE_CONF_POR_RST_WIDTH           (1U)
#define MC_RGM_MODE_CONF_POR_RST(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_MODE_CONF_POR_RST_SHIFT)) & MC_RGM_MODE_CONF_POR_RST_MASK)

#define MC_RGM_MODE_CONF_DEST_RST_MASK           (0x2U)
#define MC_RGM_MODE_CONF_DEST_RST_SHIFT          (1U)
#define MC_RGM_MODE_CONF_DEST_RST_WIDTH          (1U)
#define MC_RGM_MODE_CONF_DEST_RST(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_MODE_CONF_DEST_RST_SHIFT)) & MC_RGM_MODE_CONF_DEST_RST_MASK)

#define MC_RGM_MODE_CONF_FUNC_RST_MASK           (0x4U)
#define MC_RGM_MODE_CONF_FUNC_RST_SHIFT          (2U)
#define MC_RGM_MODE_CONF_FUNC_RST_WIDTH          (1U)
#define MC_RGM_MODE_CONF_FUNC_RST(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_MODE_CONF_FUNC_RST_SHIFT)) & MC_RGM_MODE_CONF_FUNC_RST_MASK)

#define MC_RGM_MODE_CONF_FULL_WKUP_MASK          (0x2000U)
#define MC_RGM_MODE_CONF_FULL_WKUP_SHIFT         (13U)
#define MC_RGM_MODE_CONF_FULL_WKUP_WIDTH         (1U)
#define MC_RGM_MODE_CONF_FULL_WKUP(x)            (((uint32_t)(((uint32_t)(x)) << MC_RGM_MODE_CONF_FULL_WKUP_SHIFT)) & MC_RGM_MODE_CONF_FULL_WKUP_MASK)

#define MC_RGM_MODE_CONF_LPRUN_MASK              (0x4000U)
#define MC_RGM_MODE_CONF_LPRUN_SHIFT             (14U)
#define MC_RGM_MODE_CONF_LPRUN_WIDTH             (1U)
#define MC_RGM_MODE_CONF_LPRUN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_MODE_CONF_LPRUN_SHIFT)) & MC_RGM_MODE_CONF_LPRUN_MASK)

#define MC_RGM_MODE_CONF_STANDBY_MASK            (0x8000U)
#define MC_RGM_MODE_CONF_STANDBY_SHIFT           (15U)
#define MC_RGM_MODE_CONF_STANDBY_WIDTH           (1U)
#define MC_RGM_MODE_CONF_STANDBY(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_MODE_CONF_STANDBY_SHIFT)) & MC_RGM_MODE_CONF_STANDBY_MASK)

#define MC_RGM_MODE_CONF_STDBRTOEN_MASK          (0x10000U)
#define MC_RGM_MODE_CONF_STDBRTOEN_SHIFT         (16U)
#define MC_RGM_MODE_CONF_STDBRTOEN_WIDTH         (1U)
#define MC_RGM_MODE_CONF_STDBRTOEN(x)            (((uint32_t)(((uint32_t)(x)) << MC_RGM_MODE_CONF_STDBRTOEN_SHIFT)) & MC_RGM_MODE_CONF_STDBRTOEN_MASK)
/*! @} */

/*! @name EVT_STAT - Event Status */
/*! @{ */

#define MC_RGM_EVT_STAT_F_POR_MASK               (0x1U)
#define MC_RGM_EVT_STAT_F_POR_SHIFT              (0U)
#define MC_RGM_EVT_STAT_F_POR_WIDTH              (1U)
#define MC_RGM_EVT_STAT_F_POR(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_EVT_STAT_F_POR_SHIFT)) & MC_RGM_EVT_STAT_F_POR_MASK)

#define MC_RGM_EVT_STAT_F_SUST_MASK              (0x2U)
#define MC_RGM_EVT_STAT_F_SUST_SHIFT             (1U)
#define MC_RGM_EVT_STAT_F_SUST_WIDTH             (1U)
#define MC_RGM_EVT_STAT_F_SUST(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_EVT_STAT_F_SUST_SHIFT)) & MC_RGM_EVT_STAT_F_SUST_MASK)

#define MC_RGM_EVT_STAT_F_FPM1_MASK              (0x4U)
#define MC_RGM_EVT_STAT_F_FPM1_SHIFT             (2U)
#define MC_RGM_EVT_STAT_F_FPM1_WIDTH             (1U)
#define MC_RGM_EVT_STAT_F_FPM1(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_EVT_STAT_F_FPM1_SHIFT)) & MC_RGM_EVT_STAT_F_FPM1_MASK)

