zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_RGM.h
#define MC_RGM_EVT_STAT_F_PM1_5_MASK             (0x8U)
#define MC_RGM_EVT_STAT_F_PM1_5_SHIFT            (3U)
#define MC_RGM_EVT_STAT_F_PM1_5_WIDTH            (1U)
#define MC_RGM_EVT_STAT_F_PM1_5(x)               (((uint32_t)(((uint32_t)(x)) << MC_RGM_EVT_STAT_F_PM1_5_SHIFT)) & MC_RGM_EVT_STAT_F_PM1_5_MASK)

#define MC_RGM_EVT_STAT_F_DES_MASK               (0x10U)
#define MC_RGM_EVT_STAT_F_DES_SHIFT              (4U)
#define MC_RGM_EVT_STAT_F_DES_WIDTH              (1U)
#define MC_RGM_EVT_STAT_F_DES(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_EVT_STAT_F_DES_SHIFT)) & MC_RGM_EVT_STAT_F_DES_MASK)

#define MC_RGM_EVT_STAT_F_FES_MASK               (0x20U)
#define MC_RGM_EVT_STAT_F_FES_SHIFT              (5U)
#define MC_RGM_EVT_STAT_F_FES_WIDTH              (1U)
#define MC_RGM_EVT_STAT_F_FES(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_EVT_STAT_F_FES_SHIFT)) & MC_RGM_EVT_STAT_F_FES_MASK)

#define MC_RGM_EVT_STAT_F_MTIP_MASK              (0x80U)
#define MC_RGM_EVT_STAT_F_MTIP_SHIFT             (7U)
#define MC_RGM_EVT_STAT_F_MTIP_WIDTH             (1U)
#define MC_RGM_EVT_STAT_F_MTIP(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_EVT_STAT_F_MTIP_SHIFT)) & MC_RGM_EVT_STAT_F_MTIP_MASK)
/*! @} */

/*! @name FPHTEC - Functional Reset Entry Phase Timer Enable Control */
/*! @{ */

#define MC_RGM_FPHTEC_PHASE0EN_MASK              (0x1U)
#define MC_RGM_FPHTEC_PHASE0EN_SHIFT             (0U)
#define MC_RGM_FPHTEC_PHASE0EN_WIDTH             (1U)
#define MC_RGM_FPHTEC_PHASE0EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTEC_PHASE0EN_SHIFT)) & MC_RGM_FPHTEC_PHASE0EN_MASK)

#define MC_RGM_FPHTEC_PHASE1EN_MASK              (0x2U)
#define MC_RGM_FPHTEC_PHASE1EN_SHIFT             (1U)
#define MC_RGM_FPHTEC_PHASE1EN_WIDTH             (1U)
#define MC_RGM_FPHTEC_PHASE1EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTEC_PHASE1EN_SHIFT)) & MC_RGM_FPHTEC_PHASE1EN_MASK)

#define MC_RGM_FPHTEC_PHASE2EN_MASK              (0x4U)
#define MC_RGM_FPHTEC_PHASE2EN_SHIFT             (2U)
#define MC_RGM_FPHTEC_PHASE2EN_WIDTH             (1U)
#define MC_RGM_FPHTEC_PHASE2EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTEC_PHASE2EN_SHIFT)) & MC_RGM_FPHTEC_PHASE2EN_MASK)

#define MC_RGM_FPHTEC_PHASE3EN_MASK              (0x8U)
#define MC_RGM_FPHTEC_PHASE3EN_SHIFT             (3U)
#define MC_RGM_FPHTEC_PHASE3EN_WIDTH             (1U)
#define MC_RGM_FPHTEC_PHASE3EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTEC_PHASE3EN_SHIFT)) & MC_RGM_FPHTEC_PHASE3EN_MASK)

#define MC_RGM_FPHTEC_PHASE4EN_MASK              (0x10U)
#define MC_RGM_FPHTEC_PHASE4EN_SHIFT             (4U)
#define MC_RGM_FPHTEC_PHASE4EN_WIDTH             (1U)
#define MC_RGM_FPHTEC_PHASE4EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTEC_PHASE4EN_SHIFT)) & MC_RGM_FPHTEC_PHASE4EN_MASK)

#define MC_RGM_FPHTEC_PHASE5EN_MASK              (0x20U)
#define MC_RGM_FPHTEC_PHASE5EN_SHIFT             (5U)
#define MC_RGM_FPHTEC_PHASE5EN_WIDTH             (1U)
#define MC_RGM_FPHTEC_PHASE5EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTEC_PHASE5EN_SHIFT)) & MC_RGM_FPHTEC_PHASE5EN_MASK)

#define MC_RGM_FPHTEC_PHASE6EN_MASK              (0x40U)
#define MC_RGM_FPHTEC_PHASE6EN_SHIFT             (6U)
#define MC_RGM_FPHTEC_PHASE6EN_WIDTH             (1U)
#define MC_RGM_FPHTEC_PHASE6EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTEC_PHASE6EN_SHIFT)) & MC_RGM_FPHTEC_PHASE6EN_MASK)

#define MC_RGM_FPHTEC_PHASE7EN_MASK              (0x80U)
#define MC_RGM_FPHTEC_PHASE7EN_SHIFT             (7U)
#define MC_RGM_FPHTEC_PHASE7EN_WIDTH             (1U)
#define MC_RGM_FPHTEC_PHASE7EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTEC_PHASE7EN_SHIFT)) & MC_RGM_FPHTEC_PHASE7EN_MASK)
/*! @} */

/*! @name FPHTV - Functional Reset Entry Phase Timer Value */
/*! @{ */

#define MC_RGM_FPHTV_TIMEOUT_VAL_MASK            (0xFFFFFFFFU)
#define MC_RGM_FPHTV_TIMEOUT_VAL_SHIFT           (0U)
#define MC_RGM_FPHTV_TIMEOUT_VAL_WIDTH           (32U)
#define MC_RGM_FPHTV_TIMEOUT_VAL(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTV_TIMEOUT_VAL_SHIFT)) & MC_RGM_FPHTV_TIMEOUT_VAL_MASK)
/*! @} */

/*! @name FPHTC - Functional Reset Entry Phase Timer Control */
/*! @{ */

#define MC_RGM_FPHTC_PHASE0EN_MASK               (0x1U)
#define MC_RGM_FPHTC_PHASE0EN_SHIFT              (0U)
#define MC_RGM_FPHTC_PHASE0EN_WIDTH              (1U)
#define MC_RGM_FPHTC_PHASE0EN(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTC_PHASE0EN_SHIFT)) & MC_RGM_FPHTC_PHASE0EN_MASK)

#define MC_RGM_FPHTC_PHASE1EN_MASK               (0x2U)
#define MC_RGM_FPHTC_PHASE1EN_SHIFT              (1U)
#define MC_RGM_FPHTC_PHASE1EN_WIDTH              (1U)
#define MC_RGM_FPHTC_PHASE1EN(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTC_PHASE1EN_SHIFT)) & MC_RGM_FPHTC_PHASE1EN_MASK)

#define MC_RGM_FPHTC_PHASE2EN_MASK               (0x4U)
#define MC_RGM_FPHTC_PHASE2EN_SHIFT              (2U)
#define MC_RGM_FPHTC_PHASE2EN_WIDTH              (1U)
#define MC_RGM_FPHTC_PHASE2EN(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTC_PHASE2EN_SHIFT)) & MC_RGM_FPHTC_PHASE2EN_MASK)

#define MC_RGM_FPHTC_PHASE3EN_MASK               (0x8U)
#define MC_RGM_FPHTC_PHASE3EN_SHIFT              (3U)
#define MC_RGM_FPHTC_PHASE3EN_WIDTH              (1U)
#define MC_RGM_FPHTC_PHASE3EN(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTC_PHASE3EN_SHIFT)) & MC_RGM_FPHTC_PHASE3EN_MASK)

#define MC_RGM_FPHTC_PHASE4EN_MASK               (0x10U)
#define MC_RGM_FPHTC_PHASE4EN_SHIFT              (4U)
#define MC_RGM_FPHTC_PHASE4EN_WIDTH              (1U)
#define MC_RGM_FPHTC_PHASE4EN(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTC_PHASE4EN_SHIFT)) & MC_RGM_FPHTC_PHASE4EN_MASK)

#define MC_RGM_FPHTC_PHASE5EN_MASK               (0x20U)
#define MC_RGM_FPHTC_PHASE5EN_SHIFT              (5U)
#define MC_RGM_FPHTC_PHASE5EN_WIDTH              (1U)
#define MC_RGM_FPHTC_PHASE5EN(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTC_PHASE5EN_SHIFT)) & MC_RGM_FPHTC_PHASE5EN_MASK)

