zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_RGM.h
#define MC_RGM_FPHTC_PHASE6EN_MASK               (0x40U)
#define MC_RGM_FPHTC_PHASE6EN_SHIFT              (6U)
#define MC_RGM_FPHTC_PHASE6EN_WIDTH              (1U)
#define MC_RGM_FPHTC_PHASE6EN(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTC_PHASE6EN_SHIFT)) & MC_RGM_FPHTC_PHASE6EN_MASK)

#define MC_RGM_FPHTC_PHASE7EN_MASK               (0x80U)
#define MC_RGM_FPHTC_PHASE7EN_SHIFT              (7U)
#define MC_RGM_FPHTC_PHASE7EN_WIDTH              (1U)
#define MC_RGM_FPHTC_PHASE7EN(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTC_PHASE7EN_SHIFT)) & MC_RGM_FPHTC_PHASE7EN_MASK)
/*! @} */

/*! @name FPHTES - Functional Reset Entry Phase Timer Expiry Status */
/*! @{ */

#define MC_RGM_FPHTES_PHASE0EN_MASK              (0x1U)
#define MC_RGM_FPHTES_PHASE0EN_SHIFT             (0U)
#define MC_RGM_FPHTES_PHASE0EN_WIDTH             (1U)
#define MC_RGM_FPHTES_PHASE0EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTES_PHASE0EN_SHIFT)) & MC_RGM_FPHTES_PHASE0EN_MASK)

#define MC_RGM_FPHTES_PHASE1EN_MASK              (0x2U)
#define MC_RGM_FPHTES_PHASE1EN_SHIFT             (1U)
#define MC_RGM_FPHTES_PHASE1EN_WIDTH             (1U)
#define MC_RGM_FPHTES_PHASE1EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTES_PHASE1EN_SHIFT)) & MC_RGM_FPHTES_PHASE1EN_MASK)

#define MC_RGM_FPHTES_PHASE2EN_MASK              (0x4U)
#define MC_RGM_FPHTES_PHASE2EN_SHIFT             (2U)
#define MC_RGM_FPHTES_PHASE2EN_WIDTH             (1U)
#define MC_RGM_FPHTES_PHASE2EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTES_PHASE2EN_SHIFT)) & MC_RGM_FPHTES_PHASE2EN_MASK)

#define MC_RGM_FPHTES_PHASE3EN_MASK              (0x8U)
#define MC_RGM_FPHTES_PHASE3EN_SHIFT             (3U)
#define MC_RGM_FPHTES_PHASE3EN_WIDTH             (1U)
#define MC_RGM_FPHTES_PHASE3EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTES_PHASE3EN_SHIFT)) & MC_RGM_FPHTES_PHASE3EN_MASK)

#define MC_RGM_FPHTES_PHASE4EN_MASK              (0x10U)
#define MC_RGM_FPHTES_PHASE4EN_SHIFT             (4U)
#define MC_RGM_FPHTES_PHASE4EN_WIDTH             (1U)
#define MC_RGM_FPHTES_PHASE4EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTES_PHASE4EN_SHIFT)) & MC_RGM_FPHTES_PHASE4EN_MASK)

#define MC_RGM_FPHTES_PHASE5EN_MASK              (0x20U)
#define MC_RGM_FPHTES_PHASE5EN_SHIFT             (5U)
#define MC_RGM_FPHTES_PHASE5EN_WIDTH             (1U)
#define MC_RGM_FPHTES_PHASE5EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTES_PHASE5EN_SHIFT)) & MC_RGM_FPHTES_PHASE5EN_MASK)

#define MC_RGM_FPHTES_PHASE6EN_MASK              (0x40U)
#define MC_RGM_FPHTES_PHASE6EN_SHIFT             (6U)
#define MC_RGM_FPHTES_PHASE6EN_WIDTH             (1U)
#define MC_RGM_FPHTES_PHASE6EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTES_PHASE6EN_SHIFT)) & MC_RGM_FPHTES_PHASE6EN_MASK)

#define MC_RGM_FPHTES_PHASE7EN_MASK              (0x80U)
#define MC_RGM_FPHTES_PHASE7EN_SHIFT             (7U)
#define MC_RGM_FPHTES_PHASE7EN_WIDTH             (1U)
#define MC_RGM_FPHTES_PHASE7EN(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FPHTES_PHASE7EN_SHIFT)) & MC_RGM_FPHTES_PHASE7EN_MASK)
/*! @} */

/*! @name BOOT_VAL - Boot Mode Value */
/*! @{ */

#define MC_RGM_BOOT_VAL_BMODE_MASK               (0xFFFFU)
#define MC_RGM_BOOT_VAL_BMODE_SHIFT              (0U)
#define MC_RGM_BOOT_VAL_BMODE_WIDTH              (16U)
#define MC_RGM_BOOT_VAL_BMODE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_VAL_BMODE_SHIFT)) & MC_RGM_BOOT_VAL_BMODE_MASK)
/*! @} */

/*! @name BOOT_CFG - Boot Configurations */
/*! @{ */

#define MC_RGM_BOOT_CFG_BOOTCFG0_MASK            (0x1U)
#define MC_RGM_BOOT_CFG_BOOTCFG0_SHIFT           (0U)
#define MC_RGM_BOOT_CFG_BOOTCFG0_WIDTH           (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG0(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG0_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG0_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG1_MASK            (0x2U)
#define MC_RGM_BOOT_CFG_BOOTCFG1_SHIFT           (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG1_WIDTH           (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG1(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG1_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG1_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG2_MASK            (0x4U)
#define MC_RGM_BOOT_CFG_BOOTCFG2_SHIFT           (2U)
#define MC_RGM_BOOT_CFG_BOOTCFG2_WIDTH           (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG2(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG2_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG2_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG3_MASK            (0x8U)
#define MC_RGM_BOOT_CFG_BOOTCFG3_SHIFT           (3U)
#define MC_RGM_BOOT_CFG_BOOTCFG3_WIDTH           (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG3(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG3_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG3_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG4_MASK            (0x10U)
#define MC_RGM_BOOT_CFG_BOOTCFG4_SHIFT           (4U)
#define MC_RGM_BOOT_CFG_BOOTCFG4_WIDTH           (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG4(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG4_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG4_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG5_MASK            (0x20U)
#define MC_RGM_BOOT_CFG_BOOTCFG5_SHIFT           (5U)
#define MC_RGM_BOOT_CFG_BOOTCFG5_WIDTH           (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG5(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG5_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG5_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG6_MASK            (0x40U)
#define MC_RGM_BOOT_CFG_BOOTCFG6_SHIFT           (6U)
#define MC_RGM_BOOT_CFG_BOOTCFG6_WIDTH           (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG6(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG6_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG6_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG7_MASK            (0x80U)
#define MC_RGM_BOOT_CFG_BOOTCFG7_SHIFT           (7U)
#define MC_RGM_BOOT_CFG_BOOTCFG7_WIDTH           (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG7(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG7_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG7_MASK)

