zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_RGM.h
#define MC_RGM_BOOT_CFG_BOOTCFG8_MASK            (0x100U)
#define MC_RGM_BOOT_CFG_BOOTCFG8_SHIFT           (8U)
#define MC_RGM_BOOT_CFG_BOOTCFG8_WIDTH           (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG8(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG8_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG8_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG9_MASK            (0x200U)
#define MC_RGM_BOOT_CFG_BOOTCFG9_SHIFT           (9U)
#define MC_RGM_BOOT_CFG_BOOTCFG9_WIDTH           (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG9(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG9_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG9_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG10_MASK           (0x400U)
#define MC_RGM_BOOT_CFG_BOOTCFG10_SHIFT          (10U)
#define MC_RGM_BOOT_CFG_BOOTCFG10_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG10(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG10_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG10_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG11_MASK           (0x800U)
#define MC_RGM_BOOT_CFG_BOOTCFG11_SHIFT          (11U)
#define MC_RGM_BOOT_CFG_BOOTCFG11_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG11(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG11_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG11_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG12_MASK           (0x1000U)
#define MC_RGM_BOOT_CFG_BOOTCFG12_SHIFT          (12U)
#define MC_RGM_BOOT_CFG_BOOTCFG12_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG12(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG12_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG12_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG13_MASK           (0x2000U)
#define MC_RGM_BOOT_CFG_BOOTCFG13_SHIFT          (13U)
#define MC_RGM_BOOT_CFG_BOOTCFG13_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG13(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG13_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG13_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG14_MASK           (0x4000U)
#define MC_RGM_BOOT_CFG_BOOTCFG14_SHIFT          (14U)
#define MC_RGM_BOOT_CFG_BOOTCFG14_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG14(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG14_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG14_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG15_MASK           (0x8000U)
#define MC_RGM_BOOT_CFG_BOOTCFG15_SHIFT          (15U)
#define MC_RGM_BOOT_CFG_BOOTCFG15_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG15(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG15_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG15_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG16_MASK           (0x10000U)
#define MC_RGM_BOOT_CFG_BOOTCFG16_SHIFT          (16U)
#define MC_RGM_BOOT_CFG_BOOTCFG16_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG16(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG16_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG16_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG17_MASK           (0x20000U)
#define MC_RGM_BOOT_CFG_BOOTCFG17_SHIFT          (17U)
#define MC_RGM_BOOT_CFG_BOOTCFG17_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG17(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG17_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG17_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG18_MASK           (0x40000U)
#define MC_RGM_BOOT_CFG_BOOTCFG18_SHIFT          (18U)
#define MC_RGM_BOOT_CFG_BOOTCFG18_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG18(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG18_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG18_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG19_MASK           (0x80000U)
#define MC_RGM_BOOT_CFG_BOOTCFG19_SHIFT          (19U)
#define MC_RGM_BOOT_CFG_BOOTCFG19_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG19(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG19_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG19_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG20_MASK           (0x100000U)
#define MC_RGM_BOOT_CFG_BOOTCFG20_SHIFT          (20U)
#define MC_RGM_BOOT_CFG_BOOTCFG20_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG20(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG20_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG20_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG21_MASK           (0x200000U)
#define MC_RGM_BOOT_CFG_BOOTCFG21_SHIFT          (21U)
#define MC_RGM_BOOT_CFG_BOOTCFG21_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG21(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG21_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG21_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG22_MASK           (0x400000U)
#define MC_RGM_BOOT_CFG_BOOTCFG22_SHIFT          (22U)
#define MC_RGM_BOOT_CFG_BOOTCFG22_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG22(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG22_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG22_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG23_MASK           (0x800000U)
#define MC_RGM_BOOT_CFG_BOOTCFG23_SHIFT          (23U)
#define MC_RGM_BOOT_CFG_BOOTCFG23_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG23(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG23_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG23_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG24_MASK           (0x1000000U)
#define MC_RGM_BOOT_CFG_BOOTCFG24_SHIFT          (24U)
#define MC_RGM_BOOT_CFG_BOOTCFG24_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG24(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG24_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG24_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG25_MASK           (0x2000000U)
#define MC_RGM_BOOT_CFG_BOOTCFG25_SHIFT          (25U)
#define MC_RGM_BOOT_CFG_BOOTCFG25_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG25(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG25_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG25_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG26_MASK           (0x4000000U)
#define MC_RGM_BOOT_CFG_BOOTCFG26_SHIFT          (26U)
#define MC_RGM_BOOT_CFG_BOOTCFG26_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG26(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG26_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG26_MASK)

