zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_RGM.h
#define MC_RGM_BOOT_CFG_BOOTCFG27_MASK           (0x8000000U)
#define MC_RGM_BOOT_CFG_BOOTCFG27_SHIFT          (27U)
#define MC_RGM_BOOT_CFG_BOOTCFG27_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG27(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG27_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG27_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG28_MASK           (0x10000000U)
#define MC_RGM_BOOT_CFG_BOOTCFG28_SHIFT          (28U)
#define MC_RGM_BOOT_CFG_BOOTCFG28_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG28(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG28_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG28_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG29_MASK           (0x20000000U)
#define MC_RGM_BOOT_CFG_BOOTCFG29_SHIFT          (29U)
#define MC_RGM_BOOT_CFG_BOOTCFG29_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG29(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG29_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG29_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG30_MASK           (0x40000000U)
#define MC_RGM_BOOT_CFG_BOOTCFG30_SHIFT          (30U)
#define MC_RGM_BOOT_CFG_BOOTCFG30_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG30(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG30_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG30_MASK)

#define MC_RGM_BOOT_CFG_BOOTCFG31_MASK           (0x80000000U)
#define MC_RGM_BOOT_CFG_BOOTCFG31_SHIFT          (31U)
#define MC_RGM_BOOT_CFG_BOOTCFG31_WIDTH          (1U)
#define MC_RGM_BOOT_CFG_BOOTCFG31(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_BOOT_CFG_BOOTCFG31_SHIFT)) & MC_RGM_BOOT_CFG_BOOTCFG31_MASK)
/*! @} */

/*! @name STDBYRTR - Standby Request Timeout Register */
/*! @{ */

#define MC_RGM_STDBYRTR_STDBYRT_MASK             (0xFFFFU)
#define MC_RGM_STDBYRTR_STDBYRT_SHIFT            (0U)
#define MC_RGM_STDBYRTR_STDBYRT_WIDTH            (16U)
#define MC_RGM_STDBYRTR_STDBYRT(x)               (((uint32_t)(((uint32_t)(x)) << MC_RGM_STDBYRTR_STDBYRT_SHIFT)) & MC_RGM_STDBYRTR_STDBYRT_MASK)
/*! @} */

/*! @name MODE_STAT - Mode Status Register */
/*! @{ */

#define MC_RGM_MODE_STAT_CUR_MODE_MASK           (0x7U)
#define MC_RGM_MODE_STAT_CUR_MODE_SHIFT          (0U)
#define MC_RGM_MODE_STAT_CUR_MODE_WIDTH          (3U)
#define MC_RGM_MODE_STAT_CUR_MODE(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_MODE_STAT_CUR_MODE_SHIFT)) & MC_RGM_MODE_STAT_CUR_MODE_MASK)

#define MC_RGM_MODE_STAT_PREV_MODE_MASK          (0x38U)
#define MC_RGM_MODE_STAT_PREV_MODE_SHIFT         (3U)
#define MC_RGM_MODE_STAT_PREV_MODE_WIDTH         (3U)
#define MC_RGM_MODE_STAT_PREV_MODE(x)            (((uint32_t)(((uint32_t)(x)) << MC_RGM_MODE_STAT_PREV_MODE_SHIFT)) & MC_RGM_MODE_STAT_PREV_MODE_MASK)
/*! @} */

/*! @name DRATO - Destructive Request Acknowledge Timeout Register */
/*! @{ */

#define MC_RGM_DRATO_DES_RATO_MASK               (0x1U)
#define MC_RGM_DRATO_DES_RATO_SHIFT              (0U)
#define MC_RGM_DRATO_DES_RATO_WIDTH              (1U)
#define MC_RGM_DRATO_DES_RATO(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_DRATO_DES_RATO_SHIFT)) & MC_RGM_DRATO_DES_RATO_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group MC_RGM_Register_Masks */

/*!
 * @}
 */ /* end of group MC_RGM_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_MC_RGM_H_) */
